import numpy as np
from scipy.linalg import lu

#建立10X15的高斯矩阵
a = np.random.normal(loc = 57.0, scale = 1.0, size = (10,15))
print("随机生成的高斯矩阵为：")
print(a, "\n")

#LU分解
print("-------------------------------------LU分解：-------------------------------------")
p, l, u = lu(a)
print("上三角矩阵l：", "\n", l, "\n")
print("下三角矩阵u：", "\n", u, "\n")
print("置换矩阵p：", "\n", p)
print("-------------------------------------LU分解：-------------------------------------", "\n")

#QR分解
print("-------------------------------------QR分解：-------------------------------------")
q,r=np.linalg.qr(a)
print("正交矩阵q：", "\n", q, "\n")
print("上三角矩阵r：", "\n", r)
print("-------------------------------------QR分解：-------------------------------------", "\n")

#奇异值分解
print("-------------------------------------奇异值分解：-------------------------------------")
u, s, v = np.linalg.svd(a)
print("矩阵u：", "\n", u, "\n")
print("矩阵s：", "\n", u, "\n")
print("矩阵v：", "\n", u,)
print("-------------------------------------奇异值分解：-------------------------------------", "\n")